package com.example.fallscreen;


public class LLcou {
    public int cou; // 帧计数器
    public char Width; //宽度
    // 当前位置 也就是帧 计数器

    // 色彩二维数组
    // 记录若干组线的每个点的亮度色彩 预留了 阿尔法值单元 但是未启用
    // 【R】【G】【B】【A】
    //  第一行记录线长度
    int[][] lightline = new int[1024][4];


    // 长度 - 位置   可变的长度
    // 第一行 数据总长
    int[][] lengthFrame = new int[1024][2];



    // 速度 - 位置  从上一位置到这一位置需要的 帧 或者 时间
    int[][] speedFrame = new int[1024][2];


    // 亮度 - 位置  是一个 阿尔法通道的值
    int[][]  alphaFrame = new int[1024][2];



    // 每帧计算出 上述值得变化

    // 环数据 ，记录一圈点 的坐标，主要记录圆弧，通过算法 计算出角和园



    int[] face_pit  = new int[]{417,4,
            417,5,

            427,5,
            427,6,

            437,8,
            437,9,

            445,12,
            445,13,

            453,19,
            453,20,


            460,28,
            460,29,

            465,39,
            465,40,




            470,51,
            470,52,

            474,60,
            474,61,


            480,69,
            480,70,



            487,78,
            487,79,


            495,85,
            495,86,


            504,91,
            504,92,




            514,96,
            514,97,

            526,98,
            526,99,



            540,100,
            540,101,


            554,98,
            554,99,


            566,96,
            566,97,


            576,91,
            576,92,


            585,85,
            585,86,


            593,78,
            593,79,


            600,69,
            600,70,



            606,60,
            606,61,


            610,51,
            610,52,



            615,39,
            615,40,


            620,28,
            620,29,

            627,19,
            627,20,


            635,12,
            635,13,

            643,8,
            643,9,

            653,5,
            653,6,


            663,4,
            553,5


    };






public LLcou(){




    lightline[0][0] = 20; //这是一条长度为20的线
    Width = 5; // 他的宽度是 5

    int vv[][] = {
            {900, 6, 0,0},  //线长度，过度次数
            {24, 24, 24,100},
            {50, 50, 50,200},
            {150, 150, 150,300},
            {255, 255, 255,700},
            {50, 50, 50,800},
            {24, 24, 24,900},

    };
    lightline = vv;






}










}

